Revit 2024 API
BuiltInFailures.DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim Property
 Cannot label multi-dimensions to one reporting parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReportingParamAlreadyLabelsToAnotherDim { get; }
Visual Basic
Public Shared ReadOnly Property ReportingParamAlreadyLabelsToAnotherDim As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReportingParamAlreadyLabelsToAnotherDim {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace